In [1]:
import numpy as np
import pandas as pd

In [2]:
d ={'A':[1,2,np.nan] , 'B':[5,np.nan , np.nan] , 'C':[1,2,3] }

In [3]:
df=pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [10]:
#fillna

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.fillna(value='Fill the value')

                A               B  C
0             1.0             5.0  1
1             2.0  Fill the value  2
2  Fill the value  Fill the value  3

In [15]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3